var data=[];

var dataStr = "0、微微一笑很倾城<br>\
<br>\
导演：林玉芬<br>\
年代：2016<br>\
地区：大陆<br>\
演员：杨洋 / 郑爽 / 毛晓彤 / 白宇 / 秦语 / 宋欣佳怡 / 马春瑞 / 郑业成<br>\
语言：国语<br>\
<br>\
<br>\
1、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
2、小别离<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：汪俊<br>\
年代：2016<br>\
地区：大陆<br>\
演员：黄磊 / 海清 / 张子枫 / 汪俊 / 朱媛媛 / 韩青<br>\
语言：国语<br>\
<br>\
<br>\
3、麻雀<br>\
<br>\
类型：谍战 / 民国<br>\
导演：金琛 / 周远舟<br>\
年代：2016<br>\
地区：大陆<br>\
演员：李易峰 / 周冬雨 / 张鲁一 / 张若昀 / 阚清子 / 李小冉<br>\
语言：国语<br>\
<br>\
<br>\
4、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
5、中国式关系<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：沈严<br>\
年代：2016<br>\
地区：大陆<br>\
演员：陈建斌 / 马伊琍 / 赵立新 / 胡可 / 叶倩云 / 代旭<br>\
语言：国语<br>\
<br>\
<br>\
6、微微一笑很倾城<br>\
<br>\
导演：林玉芬<br>\
年代：2016<br>\
地区：大陆<br>\
演员：杨洋 / 郑爽 / 毛晓彤 / 白宇 / 秦语 / 宋欣佳怡 / 马春瑞 / 郑业成<br>\
语言：国语<br>\
<br>\
<br>\
7、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
8、小别离<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：汪俊<br>\
年代：2016<br>\
地区：大陆<br>\
演员：黄磊 / 海清 / 张子枫 / 汪俊 / 朱媛媛 / 韩青<br>\
语言：国语<br>\
<br>\
<br>\
9、老九门<br>\
<br>\
类型：网络剧 / 悬疑<br>\
导演：梁胜权<br>\
年代：2016<br>\
地区：大陆<br>\
演员：陈伟霆 / 张艺兴 / 赵丽颖 / 胡耘豪 / 应昊茗 / 袁冰妍 / 王美人 / 王闯<br>\
语言：国语<br>\
<br>\
<br>\
10、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
11、小别离<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：汪俊<br>\
年代：2016<br>\
地区：大陆<br>\
演员：黄磊 / 海清 / 张子枫 / 汪俊 / 朱媛媛 / 韩青<br>\
语言：国语<br>\
";
var d = dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
  var c = d[i].split('<br><br>');
  data.push({
    img: c[0].replace('、',' ')+'.jpg',
    caption: c[0].split('、')[1],
    desc: c[1]
  });
}
