var data=[];

var dataStr = "0、微微一笑很倾城<br>\
<br>\
导演：林玉芬<br>\
年代：2016<br>\
地区：大陆<br>\
演员：杨洋 / 郑爽 / 毛晓彤 / 白宇 / 秦语 / 宋欣佳怡 / 马春瑞 / 郑业成<br>\
语言：国语<br>\
<br>\
<br>\
1、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
2、小别离<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：汪俊<br>\
年代：2016<br>\
地区：大陆<br>\
演员：黄磊 / 海清 / 张子枫 / 汪俊 / 朱媛媛 / 韩青<br>\
语言：国语<br>\
<br>\
<br>\
3、微微一笑很倾城<br>\
<br>\
导演：林玉芬<br>\
年代：2016<br>\
地区：大陆<br>\
演员：杨洋 / 郑爽 / 毛晓彤 / 白宇 / 秦语 / 宋欣佳怡 / 马春瑞 / 郑业成<br>\
语言：国语<br>\
<br>\
<br>\
4、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
5、小别离<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：汪俊<br>\
年代：2016<br>\
地区：大陆<br>\
演员：黄磊 / 海清 / 张子枫 / 汪俊 / 朱媛媛 / 韩青<br>\
语言：国语<br>\
<br>\
<br>\
6、微微一笑很倾城<br>\
<br>\
导演：林玉芬<br>\
年代：2016<br>\
地区：大陆<br>\
演员：杨洋 / 郑爽 / 毛晓彤 / 白宇 / 秦语 / 宋欣佳怡 / 马春瑞 / 郑业成<br>\
语言：国语<br>\
<br>\
<br>\
7、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
8、小别离<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：汪俊<br>\
年代：2016<br>\
地区：大陆<br>\
演员：黄磊 / 海清 / 张子枫 / 汪俊 / 朱媛媛 / 韩青<br>\
语言：国语<br>\
<br>\
<br>\
9、微微一笑很倾城<br>\
<br>\
导演：林玉芬<br>\
年代：2016<br>\
地区：大陆<br>\
演员：杨洋 / 郑爽 / 毛晓彤 / 白宇 / 秦语 / 宋欣佳怡 / 马春瑞 / 郑业成<br>\
语言：国语<br>\
<br>\
<br>\
10、炮神<br>\
<br>\
导演：王飞 / 杜修斌 / 耿明吉<br>\
类型：军事<br>\
年代：2016<br>\
地区：大陆<br>\
演员：于震 / 刘小锋 / 牛丽燕 / 张光北 / 张笑君 / 尹馨梓 / 王佳宁 / 王超 <br>\
语言：国语<br>\
<br>\
<br>\
11、小别离<br>\
<br>\
类型：偶像 / 家庭剧 / 都市<br>\
导演：汪俊<br>\
年代：2016<br>\
地区：大陆<br>\
演员：黄磊 / 海清 / 张子枫 / 汪俊 / 朱媛媛 / 韩青<br>\
语言：国语<br>\
";
var d = dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
  var c = d[i].split('<br><br>');
  data.push({
    img: c[0].replace('、',' ')+'.jpg',
    caption: c[0].split('、')[1],
    desc: c[1]
  });
}
